#### DirectContext3DHandleOverrides Members

---

|  |
| --- |
| DirectContext3DHandleOverrides Class   Methods   Properties   See Also |

The  DirectContext3DHandleOverrides  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Assign | Assigns values of the source overrides to this object. |
| Public method | Dispose | Releases all resources used by the  DirectContext3DHandleOverrides |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetDirectContext3DHandleSettings | Gets override settings associated with a DirectContext3D handle instance or type. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsEqual | Check if the contents of two overrides are equal. |
| Public method | SetDirectContext3DHandleSettings | Assigns override settings associated with a DirectContext3D handle instance or type. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DirectContext3DHandleOverrides Class

Autodesk.Revit.DB.DirectContext3D Namespace